app/controllers/pins_controller.rb

  def create
    @pin = current_user.pins.build(pin_params)

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("created_at", "description", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 07 May 2014 17:49:08 UTC +00:00], ["description", "This is my pin"], ["updated_at", Wed, 07 May 2014 17:49:08 UTC +00:00]]

    def set_pin
      @pin = Pin.find(params[:id])
---
SELECT "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", "6"]]